artillery/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 30
      arrivalRate: 100
      name: "Peak load"
  defaults:
    headers:
      Content-Type: "application/json"
  plugins:
    ensure: {}
  ensure:
    p95: 200
    maxErrorRate: 1

scenarios:
  - name: "Health Check"
    weight: 70
    flow:
      - get:
          url: "/api/health"
      - get:
          url: "/"

  - name: "Browsing Flow (Requires Seeded User)"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@resto.com"
            password: "password123"
          capture:
            - json: "$.accessToken"
              as: "token"
          expect: 
            - statusCode: 200
      - get:
          url: "/api/products"
          headers:
            Authorization: "Bearer {{ token }}"